app/controllers/movies_controller.rb

  def index
	@all_ratings = ['G','PG','PG-13','R']
	@hilite1 = @hilite2 = ""
	items = Movie.all
	@params = params
	@sort = params[:sort]
	@ratings = params[:ratings]
	if @ratings == nil
		@ratings = Hash.new
	else
		items = Movie.where(:rating => @ratings.keys)
---
SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')